**강사: 멀티캠퍼스 강선구 강사** (sun9sun9@gmail.com)

In [1]:
# 이 영역은 수정하시면 안됩니다.

import os
import pandas as pd
from sqlalchemy import create_engine, text
import cx_Oracle
from IPython.core.magic import register_cell_magic
import sys
if sys.version.find('GCC') >= 0:
    DATABASE_URL = "oracle+cx_oracle://lib:multisqld@oracle-db:1521/?service_name=XEPDB1"
else:
    cx_Oracle.init_oracle_client(lib_dir = r"C:\Oracle\instantclient_23_7")
    DATABASE_URL = "oracle+cx_oracle://lib:multisqld@localhost:1521/?service_name=XEPDB1"
pd.set_option("display.max_colwidth", 500)
engine = create_engine(DATABASE_URL)
def get_rows(qry):
    try:
        with engine.connect() as conn:
            result = conn.execute(text(qry))
            df = pd.DataFrame(result.fetchall(), columns = result.keys()).fillna('NULL').pipe(lambda x: x.set_index(x.index + 1))
            return df if len(df) != 1 else df.iloc[0]
    except Exception as e:
        print(e)

def exec_qry(qry):
    try:
        with engine.connect() as conn:
            result = conn.execute(text(qry))
            conn.commit()
            return result
    except Exception as e:
        print(e)

@register_cell_magic
def SQL(line, cell):
    sql = cell.strip().replace(';', '')
    if sql.lower().startswith('select'):
        return get_rows(sql)
    else:
        exec_qry(sql)

# 서브쿼리 

**동작 방식에 따른 분류**
|종류|설명|
|------|-----|
|비연관(Un-Correlated) 서브 쿼리|메인 쿼리의 컬럼을 참조하지 않는 서브 쿼리.|
|연관(Correlated)서브 쿼리|메인 쿼리의 컬럼을 참조하는 서브 쿼리.<br/>EXISTS (연관 서브쿼리) 연산<br/>EXISTS의 연관 서브 쿼리가 반환하는 행이 하나 이상이면 참(TRUE)을 반환|

**[예제 1]** 서브 쿼리의 종류를 살펴봅니다.

In [2]:
%%SQL

SELECT * FROM member1 -- member1의 내용을 봅니다.

          member_id member_name region address1  address2
1      ze3herzyk1qt         황수호   경상북도      영주시   숫골길 2번길
2     tm965wcz7f4ob         이지후   충청북도      음성군     장성 3길
3     3huv3i06r0kjq          장준    경기도  성남시 중원구   은행로 4번길
4  q056e4pksva2jxr4         박준우  인천광역시      남동구  선수촌로 1번길
5      2457e3i56i37         정연서   충청남도      논산시  득안대로 2번길
6   pqdjzohyv0zx2u4         김가현  광주광역시       북구   효열로 9번길
7    eqf2ulxx6fns6q         강예은  광주광역시       서구     풍암 8로
8     fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길

- 비연관 서브 쿼리 입니다. in 연산을 통해 member1에서 가져온 member_id를 포함된 rating의 목록을 가져옵니다.

In [3]:
%%SQL

SELECT * FROM rating r
WHERE member_id in (
    SELECT member_id FROM member1
)

   book_id        member_id  rating           rate_date
1       13     ze3herzyk1qt      10 2023-08-06 13:51:20
2     1063    fy32r7vjr0irp       8 2021-01-01 14:28:40
3     1770    tm965wcz7f4ob       9 2021-04-03 15:38:37
4     2084  pqdjzohyv0zx2u4      10 2020-05-10 14:04:44
5     2949    tm965wcz7f4ob       7 2020-07-28 15:45:58
6     3270   eqf2ulxx6fns6q      10 2020-09-17 16:11:06
7     3410    tm965wcz7f4ob       9 2019-12-23 12:45:18
8     3450     2457e3i56i37       7 2023-06-07 13:24:32

- 연관 서브 쿼리 입니다. exists 절에서는 FROM 절에서 가져온 r을 참조하여 member1에서 있을 경우 1이 반환되어 가져와지도록 합니다.

In [4]:
%%SQL

SELECT * 
FROM rating r
WHERE exists (
    SELECT 1 FROM member1 m WHERE m.member_id = r.member_id
)

   book_id        member_id  rating           rate_date
1       13     ze3herzyk1qt      10 2023-08-06 13:51:20
2     1063    fy32r7vjr0irp       8 2021-01-01 14:28:40
3     1770    tm965wcz7f4ob       9 2021-04-03 15:38:37
4     2084  pqdjzohyv0zx2u4      10 2020-05-10 14:04:44
5     2949    tm965wcz7f4ob       7 2020-07-28 15:45:58
6     3270   eqf2ulxx6fns6q      10 2020-09-17 16:11:06
7     3410    tm965wcz7f4ob       9 2019-12-23 12:45:18
8     3450     2457e3i56i37       7 2023-06-07 13:24:32

**반환되는 데이터의 수에 따른 분류**

|종류|설명|
|----|----|
|단일행(Single Row) 서브 쿼리|항상 1건 이하의 행을 반환|
|다중행(Multi Row) 서브 쿼리| 1건이 넘는 행을 반환|
|다중컬럼(Multi Column) 서브 쿼리| 여러 컬럼을 반환|
|인라인 뷰(Inline view| 테이블을 반환

**[예제 2]** 반환되는 데이터의 수에 따른 분류에 따른 서브 쿼리를 살펴봅니다.

In [5]:
%%SQL

SELECT avg(rating) FROM rating -- rating에서 평균을 구합니다.

AVG(RATING)    8.59387984764542936288088642659279778393
Name: 1, dtype: object

- 조건문에서 rating의 평균보다 큰 데이터 수를 구합니다. : 단일행 서브쿼리

In [6]:
%%SQL

SELECT count(*)
FROM rating
WHERE rating > (SELECT avg(rating) FROM rating)

COUNT(*)    14216
Name: 1, dtype: int64

- 선택 표현식 내부에서 서브 쿼리를 사용합니다. rating에서 member_id, book_id, rating과 함께,

  평균이상 이면 '평균이상' 그렇지 않으면 '평균미만'을 출력하는 컬럼을 만듭니다. : 단일행 서브 쿼리

In [7]:
%%SQL

SELECT member_id, book_id, rating,
    CASE
        WHEN rating >= (SELECT avg(rating) FROM rating) THEN '평균이상'
        ELSE '평균미만'
    END 평점구분
FROM rating

               member_id  book_id  rating  평점구분
1      mvcxi5oa5spzr23ib       17       9  평균이상
2       n5d8tlcgk4udln6e       17      10  평균이상
3          ochprsofd798o       17      10  평균이상
4           peaap1snl98s       17       9  평균이상
5           psf9zn4cl64g       17       8  평균미만
...                  ...      ...     ...   ...
23100          zgaq7op08     3472       9  평균이상
23101      zys13g57edy1e     3472       9  평균이상
23102     4d1ffxsvd57q27     3476       9  평균이상
23103      gcvi01ib0mp1x     3476       9  평균이상
23104      vc457dwkbw57y     3476       6  평균미만

[23104 rows x 4 columns]

In [8]:
%%SQL

SELECT * FROM book1 -- book1의 내용을 봅니다.

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,1061,양철북 2,489,민음사,2000-03-01
4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
8,1059,데미안,489,민음사,2000-12-01
9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01

In [9]:
%%SQL

SELECT publisher, min(pub_date)
FROM book1
GROUP BY publisher -- book1에서 publisher 별 pub_date의 최소값을 가져옵니다.

  publisher MIN(PUB_DATE)
1       김영사    2015-11-01
2       민음사    1998-09-01
3       마더텅    2018-03-01
4  까치(까치글방)    2021-01-01
5       한길사    2017-12-01
6    저녁달고양이    2019-09-01

- book1에서 publisher별 pub_date의 최소값에 해당하는 publisher와 pub_date를 가져옵니다: 다중 컬럼 / 다중행

In [10]:
%%SQL

SELECT * 
FROM book1
WHERE (publisher, pub_date) in (
    SELECT publisher, min(pub_date)
    FROM book1
    GROUP BY publisher
)

   book_id                   book_title  book_categ_id publisher   pub_date
1     2219                         사피엔스           1062       김영사 2015-11-01
2     1097                    문학이란 무엇인가            509       민음사 1998-09-01
3     3233  뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)           1535       마더텅 2018-03-01
4     2497                    생명이란 무엇인가           1196  까치(까치글방) 2021-01-01
5     1137                  잃어버린 아이 이야기            534       한길사 2017-12-01
6     1092                      동주와 빈센트            503    저녁달고양이 2019-09-01

- rent1과 rating에서 book_id 별 평균을 구하여 book_id 기준으로 결합을 합니다.

In [11]:
%%SQL
SELECT book_id, avg(rating) as book_avg_rating
FROM rating
GROUP BY book_id

      book_id                           book_avg_rating
1          23                                       9.5
2          27                                         8
3         135                                      7.75
4          50                                       9.2
5          52                                   5.46875
...       ...                                       ...
1786     3452                                         9
1787     3456                                        10
1788     3366                                         9
1789     3367                                      9.25
1790     3377  8.89583333333333333333333333333333333333

[1790 rows x 2 columns]

In [12]:
%%SQL

SELECT a.*, round(b.book_avg_rating, 2) as 도서평점
FROM rent1 a LEFT OUTER JOIN (
    SELECT book_id, avg(rating) as book_avg_rating
    FROM rating
    GROUP BY book_id
) b ON a.book_id = b.book_id

,book_id,stock_seq,member_id,rent_no,rent_date,return_date,도서평점
1,3227,4,1gd09up7yy04g,1,NULL,NULL,9.14
2,1646,1,5vsfyi7idtz5,1,2025-02-20 16:08:11,2025-02-23 11:20:50,9.11
3,3239,3,7x5l3s55cf6f,1,2025-02-20 16:44:32,NULL,9.18
4,1755,2,d12xdo7llc403y,1,2025-02-20 15:56:00,2025-02-26 14:13:57,8
5,974,2,ggy2kempjacz3,1,2025-02-20 16:40:54,NULL,9.31
6,3118,1,hzqia2,1,2025-02-20 16:03:10,2025-02-25 12:24:10,NULL
7,1320,2,iypp7k79n,1,2025-02-20 16:14:16,2025-02-25 10:47:57,1
8,156,1,j5ep1e6,1,NULL,NULL,10
9,1154,1,mkkctuz5,1,2025-02-20 16:26:49,2025-02-28 16:43:43,NULL
10,1471,1,pdjx0oac,1,2025-02-20 16:54:55,NULL,NULL

# 집합 연산자

|종류|설명|
|----|-----|
|UNION|중복된 행은 하나의 행으로 하는 합집합 연산|
|UNION ALL|중복 여부와 상관없이 모든 행들을 포함하는 합집합 연산|
|INTERSECT|교집합 연산. 중복된 행은 하나의 행으로 통합됨|
|EXCEPT	차집합 연산|중복된 행은 제외가 됨. (Oracle :MINUS 연산자, SQL Server: EXCEPT)|

[**예제 3**] 집합 연산자의 기능을 알아봅니다.

In [13]:
%%SQL

SELECT * FROM member1

          member_id member_name region address1  address2
1      ze3herzyk1qt         황수호   경상북도      영주시   숫골길 2번길
2     tm965wcz7f4ob         이지후   충청북도      음성군     장성 3길
3     3huv3i06r0kjq          장준    경기도  성남시 중원구   은행로 4번길
4  q056e4pksva2jxr4         박준우  인천광역시      남동구  선수촌로 1번길
5      2457e3i56i37         정연서   충청남도      논산시  득안대로 2번길
6   pqdjzohyv0zx2u4         김가현  광주광역시       북구   효열로 9번길
7    eqf2ulxx6fns6q         강예은  광주광역시       서구     풍암 8로
8     fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길

member1은 member의 부분 집합니다. 3번째 컬럼의 member_id 보다 같거나 큰 행들을 가져와 member1의 내용을 가진 행을 가져옵니다,

In [14]:
%%SQL

SELECT member_id, member_name, region, address1, address2 
FROM member 
WHERE member_id >= '3huv3i06r0kjq' 
ORDER BY member_id
OFFSET 0 ROWS FETCH FIRST 3 ROWS ONLY

          member_id member_name region address1  address2
1     3huv3i06r0kjq          장준    경기도  성남시 중원구   은행로 4번길
2  3hxhr9dpphjij052         서하윤   충청남도      논산시   선비로 9번길
3        3hy4i6515h         김지호    경기도      화성시  야목서길 2번길

- 위에서 가져온 두 개의 결과를 UNION 으로 결합니다.

In [15]:
%%SQL

SELECT * FROM member1
UNION
(
    SELECT member_id, member_name, region, address1, address2 
    FROM member 
    WHERE member_id >= '3huv3i06r0kjq'
    ORDER BY member_id
    OFFSET 0 ROWS FETCH FIRST 3 ROWS ONLY
)

           member_id member_name region address1  address2
1       ze3herzyk1qt         황수호   경상북도      영주시   숫골길 2번길
2      tm965wcz7f4ob         이지후   충청북도      음성군     장성 3길
3      3huv3i06r0kjq          장준    경기도  성남시 중원구   은행로 4번길
4   q056e4pksva2jxr4         박준우  인천광역시      남동구  선수촌로 1번길
5       2457e3i56i37         정연서   충청남도      논산시  득안대로 2번길
6    pqdjzohyv0zx2u4         김가현  광주광역시       북구   효열로 9번길
7     eqf2ulxx6fns6q         강예은  광주광역시       서구     풍암 8로
8      fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길
9   3hxhr9dpphjij052         서하윤   충청남도      논산시   선비로 9번길
10        3hy4i6515h         김지호    경기도      화성시  야목서길 2번길

- 위에서 가져온 두 개의 결과를 UNION ALL 결합니다.

In [16]:
%%SQL

SELECT * FROM member1
UNION ALL
(
    SELECT member_id, member_name, region, address1, address2 
    FROM member 
    WHERE member_id >= '3huv3i06r0kjq'
    ORDER BY member_id
    OFFSET 0 ROWS FETCH FIRST 3 ROWS ONLY
)

           member_id member_name region address1  address2
1       ze3herzyk1qt         황수호   경상북도      영주시   숫골길 2번길
2      tm965wcz7f4ob         이지후   충청북도      음성군     장성 3길
3      3huv3i06r0kjq          장준    경기도  성남시 중원구   은행로 4번길
4   q056e4pksva2jxr4         박준우  인천광역시      남동구  선수촌로 1번길
5       2457e3i56i37         정연서   충청남도      논산시  득안대로 2번길
6    pqdjzohyv0zx2u4         김가현  광주광역시       북구   효열로 9번길
7     eqf2ulxx6fns6q         강예은  광주광역시       서구     풍암 8로
8      fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길
9      3huv3i06r0kjq          장준    경기도  성남시 중원구   은행로 4번길
10  3hxhr9dpphjij052         서하윤   충청남도      논산시   선비로 9번길
11        3hy4i6515h         김지호    경기도      화성시  야목서길 2번길

- 두 개의 결과의 교집합을 구합니다.

In [17]:
%%SQL

SELECT * FROM member1
INTERSECT
(
    SELECT member_id, member_name, region, address1, address2 
    FROM member 
    WHERE member_id >= '3huv3i06r0kjq'
    ORDER BY member_id
    OFFSET 0 ROWS FETCH FIRST 3 ROWS ONLY
)

member_id      3huv3i06r0kjq
member_name               장준
region                   경기도
address1             성남시 중원구
address2             은행로 4번길
Name: 1, dtype: object

- member1에서 MINUS 이후의 쿼리의 결과와의 차집합 연산을 수행합니다.

In [18]:
%%SQL

SELECT * FROM member1
MINUS
(
    SELECT member_id, member_name, region, address1, address2 
    FROM member 
    WHERE member_id >= '3huv3i06r0kjq'
    ORDER BY member_id
    OFFSET 0 ROWS FETCH FIRST 3 ROWS ONLY
)

          member_id member_name region address1  address2
1      ze3herzyk1qt         황수호   경상북도      영주시   숫골길 2번길
2     tm965wcz7f4ob         이지후   충청북도      음성군     장성 3길
3  q056e4pksva2jxr4         박준우  인천광역시      남동구  선수촌로 1번길
4      2457e3i56i37         정연서   충청남도      논산시  득안대로 2번길
5   pqdjzohyv0zx2u4         김가현  광주광역시       북구   효열로 9번길
6    eqf2ulxx6fns6q         강예은  광주광역시       서구     풍암 8로
7     fy32r7vjr0irp         박기현   경상남도  창원시 진해구  웅천북로 7번길

# 윈도우 함수 


```SQL
SELECT 윈도우 함수(매개변수) OVER (연산 범위 구문)
FROM ...
```

**연산 범위 구문**

\[PARTITION BY 컬럼\] \[ORDER BY 절\] \[WINDOWING 절\]

|연산 범위 지정자|설명|
|-----|-----|
|PARTITION BY 컬럼|지정한 컬럼을 기준으로 현재 행의 값과 동일한 값을 지닌 행들이 범위|
|ORDER BY 절|범위로 지정된 행들의 정렬 순서|

윈도우 함수(Window Function)는 **각각의 행(Row)** 을 기준으로,

`OVER()` 절에서 지정한 **범위(Window)** 내의 데이터와 연산을 수행하여  

그 결과를 각 행에 반환하는 함수입니다.  

즉, "각 행마다 주변(같은 그룹 또는 지정 범위)의 데이터를 모아서 계산한 값"을 출력할 수 있습니다.  

이때, 집계 연산을 하더라도 행이 사라지지 않고 그대로 유지됩니다.

**윈도우함수**

<table>
  <tr>
    <th>종류</th><th>함수</th><th>설명</th>
  </tr>
  <tr>
    <td rowspan="3">순위</td><td>RANK()</td><td>순위</td>
  </tr>
  <tr>
    <td>DENSE_RANK()</td><td>순위, 동일한 순위를 하나의 건수로 취급</td>
  </tr>
  <tr>
    <td>ROW_NUMBER()</td><td>순서</td>
  </tr>
  <tr>
    <td rowspan="4">순서</td><td>FIRST_VALUE(표현)</td><td>첫번째 값</td>
  </tr>
  <tr>
    <td>LAST_VALUE(표현)</td><td>마지막 값</td>
  </tr>
  <tr>
    <td>LAG(표현[, 위치][, 기본값)</td><td>이전 값</td>
  </tr>
  <tr>
    <td>LEAD(표현[, 위치][, 기본값)</td><td>이후 값</td>
  </tr>
  <tr>
    <td rowspan="4">비율</td><td>RATIO_TO_REPORT(표현)</td><td>범위합에서 현재값의 비율</td>
  </tr>
  <tr>
    <td>PERCENT_RANK()</td><td>백분위</td>
  </tr>
  <tr>
    <td>CUME_DIST()</td><td>누적분위</td>
  </tr>
  <tr>
    <td>NTILE(N)</td><td>N분위수</td>
  </tr> 
</table>

**[예제 4]** 윈도우 함수의 기능을 알아봅니다.

In [19]:
%%SQL
SELECT * FROM book1 -- book1의 내용을 가져옵니다.

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,1061,양철북 2,489,민음사,2000-03-01
4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
8,1059,데미안,489,민음사,2000-12-01
9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01

- OVER에서 PARTITION BY와 같은 한정 구문을 넣지 않으면 모든 행을 window 함수의 대상 행으로 잡습니다.

In [20]:
%%SQL

SELECT book_title, publisher, pub_date, 
    rank() OVER (ORDER BY pub_date) as 출간순서
FROM book1

                         book_title publisher   pub_date  출간순서
1                         문학이란 무엇인가       민음사 1998-09-01     1
2                             양철북 2       민음사 2000-03-01     2
3                               데미안       민음사 2000-12-01     3
4                              사피엔스       김영사 2015-11-01     4
5                       잃어버린 아이 이야기       한길사 2017-12-01     5
6       뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)       마더텅 2018-03-01     6
7    초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1       마더텅 2019-04-01     7
8                           동주와 빈센트    저녁달고양이 2019-09-01     8
9   뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)       마더텅 2019-12-01     9
10                        생명이란 무엇인가  까치(까치글방) 2021-01-01    10

- OVER에서 PARTITION BY publisher를 통해 window 함수의 대상 행을 publisher가 같은 행으로 한정을 시킵니다.

In [21]:
%%SQL

SELECT book_title, publisher, pub_date, 
    rank() OVER (PARTITION BY publisher ORDER BY pub_date) as 출간순서
FROM book1
ORDER BY book_title

                         book_title publisher   pub_date  출간순서
1                               데미안       민음사 2000-12-01     3
2                           동주와 빈센트    저녁달고양이 2019-09-01     1
3                         문학이란 무엇인가       민음사 1998-09-01     1
4       뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)       마더텅 2018-03-01     1
5   뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)       마더텅 2019-12-01     3
6                              사피엔스       김영사 2015-11-01     1
7                         생명이란 무엇인가  까치(까치글방) 2021-01-01     1
8                             양철북 2       민음사 2000-03-01     2
9                       잃어버린 아이 이야기       한길사 2017-12-01     1
10   초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1       마더텅 2019-04-01     2

In [22]:
%%SQL

SELECT book_title, publisher, pub_date, extract(YEAR from pub_date) year FROM book
FETCH FIRST 12 ROWS ONLY -- 처음에 12개의 행만을 가져옵니다.

              book_title publisher   pub_date  year
1              디렉터 6과 링고        대림 1999-02-01  1999
2         마르크스 그 가능성의 중심        이산 1999-05-01  1999
3               도예 기초 실기        예경 1999-08-01  1999
4                   제제공학      신일상사 1999-09-01  1999
5          한국 공동주택계획의 역사       세진사 1999-10-01  1999
6   우리 수학자 모두는 약간 미친 겁니다        승산 1999-10-01  1999
7                황소와 도깨비        다림 1999-11-01  1999
8            가톨릭 성인전 (하)    가톨릭출판사 1999-11-01  1999
9              정현종 시전집 1    문학과지성사 1999-12-01  1999
10              백년의 고독 2       민음사 2000-01-01  2000
11                 양철북 2       민음사 2000-03-01  2000
12                 변성암석학    시그마프레스 2000-03-01  2000

In [23]:
%%SQL

SELECT * FROM (
    SELECT book_title, publisher, pub_date, extract(YEAR from pub_date) year FROM book
    FETCH FIRST 12 ROWS ONLY
) -- 가져온 12개을 인라인뷰 행태로 사용해본것입니다.

              book_title publisher   pub_date  year
1              디렉터 6과 링고        대림 1999-02-01  1999
2         마르크스 그 가능성의 중심        이산 1999-05-01  1999
3               도예 기초 실기        예경 1999-08-01  1999
4                   제제공학      신일상사 1999-09-01  1999
5          한국 공동주택계획의 역사       세진사 1999-10-01  1999
6   우리 수학자 모두는 약간 미친 겁니다        승산 1999-10-01  1999
7                황소와 도깨비        다림 1999-11-01  1999
8            가톨릭 성인전 (하)    가톨릭출판사 1999-11-01  1999
9              정현종 시전집 1    문학과지성사 1999-12-01  1999
10              백년의 고독 2       민음사 2000-01-01  2000
11                 양철북 2       민음사 2000-03-01  2000
12                 변성암석학    시그마프레스 2000-03-01  2000

- 위 인라인뷰로 rank 작업을 합니다. rank는 동일순위 일경우 다음 순위는 동일 순위 만큼 건너 뛴다음의 순위가 됩니다.

In [24]:
%%SQL

SELECT book_title, publisher, pub_date, 
    rank() OVER (PARTITION BY year ORDER BY pub_date) 연간순서 
FROM (
    SELECT book_title, publisher, pub_date, extract(YEAR from pub_date) year FROM book
    FETCH FIRST 12 ROWS ONLY
)

              book_title publisher   pub_date  연간순서
1              디렉터 6과 링고        대림 1999-02-01     1
2         마르크스 그 가능성의 중심        이산 1999-05-01     2
3               도예 기초 실기        예경 1999-08-01     3
4                   제제공학      신일상사 1999-09-01     4
5          한국 공동주택계획의 역사       세진사 1999-10-01     5
6   우리 수학자 모두는 약간 미친 겁니다        승산 1999-10-01     5
7                황소와 도깨비        다림 1999-11-01     7
8            가톨릭 성인전 (하)    가톨릭출판사 1999-11-01     7
9              정현종 시전집 1    문학과지성사 1999-12-01     9
10              백년의 고독 2       민음사 2000-01-01     1
11                 양철북 2       민음사 2000-03-01     2
12                 변성암석학    시그마프레스 2000-03-01     2

- 반면 dense_rank는 동일순위 일경우 다음 순위는 바로 그 다음 순위로 메겨집니다.

In [25]:
%%SQL

SELECT book_title, publisher, pub_date, 
    dense_rank() OVER (PARTITION BY year ORDER BY pub_date) 연간순위 
FROM (
    SELECT book_title, publisher, pub_date, extract(YEAR from pub_date) year FROM book
    FETCH FIRST 12 ROWS ONLY
)

              book_title publisher   pub_date  연간순위
1              디렉터 6과 링고        대림 1999-02-01     1
2         마르크스 그 가능성의 중심        이산 1999-05-01     2
3               도예 기초 실기        예경 1999-08-01     3
4                   제제공학      신일상사 1999-09-01     4
5          한국 공동주택계획의 역사       세진사 1999-10-01     5
6   우리 수학자 모두는 약간 미친 겁니다        승산 1999-10-01     5
7                황소와 도깨비        다림 1999-11-01     6
8            가톨릭 성인전 (하)    가톨릭출판사 1999-11-01     6
9              정현종 시전집 1    문학과지성사 1999-12-01     7
10              백년의 고독 2       민음사 2000-01-01     1
11                 양철북 2       민음사 2000-03-01     2
12                 변성암석학    시그마프레스 2000-03-01     2

- row_number는 1씩 무조건 증가하므로, 동일 여부와 상관없는 순위를 구하는 데 사용할 수 있습니다.

In [26]:
%%SQL

SELECT book_title, publisher, pub_date, 
    row_number() OVER (PARTITION BY year ORDER BY pub_date) 연간순위 
FROM (
    SELECT book_title, publisher, pub_date, extract(YEAR from pub_date) year FROM book
    FETCH FIRST 12 ROWS ONLY
)

              book_title publisher   pub_date  연간순위
1              디렉터 6과 링고        대림 1999-02-01     1
2         마르크스 그 가능성의 중심        이산 1999-05-01     2
3               도예 기초 실기        예경 1999-08-01     3
4                   제제공학      신일상사 1999-09-01     4
5          한국 공동주택계획의 역사       세진사 1999-10-01     5
6   우리 수학자 모두는 약간 미친 겁니다        승산 1999-10-01     6
7                황소와 도깨비        다림 1999-11-01     7
8            가톨릭 성인전 (하)    가톨릭출판사 1999-11-01     8
9              정현종 시전집 1    문학과지성사 1999-12-01     9
10              백년의 고독 2       민음사 2000-01-01     1
11                 양철북 2       민음사 2000-03-01     2
12                 변성암석학    시그마프레스 2000-03-01     3

In [27]:
%%SQL

SELECT book_title, publisher, pub_date, 
    CUME_DIST() OVER (PARTITION BY year ORDER BY pub_date) 연간순위 
FROM (
    SELECT book_title, publisher, pub_date, extract(YEAR from pub_date) year FROM book
    FETCH FIRST 12 ROWS ONLY
)

,book_title,publisher,pub_date,연간순위
1,디렉터 6과 링고,대림,1999-02-01,0.1111111111111111111111111111111111111111
2,마르크스 그 가능성의 중심,이산,1999-05-01,0.2222222222222222222222222222222222222222
3,도예 기초 실기,예경,1999-08-01,0.3333333333333333333333333333333333333333
4,제제공학,신일상사,1999-09-01,0.4444444444444444444444444444444444444444
5,한국 공동주택계획의 역사,세진사,1999-10-01,0.6666666666666666666666666666666666666667
6,우리 수학자 모두는 약간 미친 겁니다,승산,1999-10-01,0.6666666666666666666666666666666666666667
7,황소와 도깨비,다림,1999-11-01,0.8888888888888888888888888888888888888889
8,가톨릭 성인전 (하),가톨릭출판사,1999-11-01,0.8888888888888888888888888888888888888889
9,정현종 시전집 1,문학과지성사,1999-12-01,1
10,백년의 고독 2,민음사,2000-01-01,0.3333333333333333333333333333333333333333
11,양철북 2,민음사,2000-03-01,1
12,변성암석학,시그마프레스,2000-03-01,1

- book_id 별로 일련 번호(row_number)를 구하고 이 숫자가 5 미만을 출력하는 조건을 가해서 book_id 별로 4개가 넘지 않는 행을 출력합니다.

In [28]:
%%SQL
SELECT * FROM (
    SELECT book_id, member_id, rating, rate_date, row_number() OVER (PARTITION BY book_id ORDER BY rate_date) rnum
    FROM rating
) WHERE rnum < 5
FETCH FIRST 12 ROWS ONLY

    book_id         member_id  rating           rate_date  rnum
1         2          k1jw97m3       9 2022-04-11 15:13:01     1
2         2        1s3sdgncps      10 2023-01-14 12:30:07     2
3         3        3gln64wcw6      10 2019-11-03 11:47:24     1
4         3          r5g55xke      10 2019-11-13 12:08:06     2
5         3       2kijdsgzqzt       9 2020-02-10 13:52:19     3
6         3  kw7w3xr53gtlv2lt       9 2020-08-10 15:32:46     4
7         4      yo0hk2wrkcyq       9 2019-11-04 15:17:00     1
8         4      17tfqvonyku8       7 2019-11-28 15:41:54     2
9         4      56n3kpevgfer       9 2020-04-21 09:57:29     3
10        4    3v3eijl0vaj6dr       8 2020-09-24 13:53:34     4
11        5     ts2sjsg7jyhor      10 2023-07-08 09:27:19     1
12        5       glsumlpx4li       8 2023-09-13 13:05:05     2

- book_id 별로 일련 번호(row_number)를 구하고 이 숫자가 11 미만을 출력하는 조건을 가해서 book_id 별로 10개가 넘지 않는 행을 출력합니다.

In [29]:
%%SQL

SELECT * FROM (
    SELECT book_id, member_id, rating, rate_date, row_number() OVER (PARTITION BY book_id ORDER BY rate_date) rnum
    FROM rating
) WHERE rnum <= 10
FETCH FIRST 10 ROWS ONLY

    book_id         member_id  rating           rate_date  rnum
1         2          k1jw97m3       9 2022-04-11 15:13:01     1
2         2        1s3sdgncps      10 2023-01-14 12:30:07     2
3         3        3gln64wcw6      10 2019-11-03 11:47:24     1
4         3          r5g55xke      10 2019-11-13 12:08:06     2
5         3       2kijdsgzqzt       9 2020-02-10 13:52:19     3
6         3  kw7w3xr53gtlv2lt       9 2020-08-10 15:32:46     4
7         3     jkyzj42jx8twv       9 2020-08-27 16:35:20     5
8         3        gammptvqxf      10 2020-11-26 10:18:18     6
9         3       6b9eczd6hvd       9 2021-04-22 15:24:36     7
10        3    bas9s86v1bkp89       8 2021-06-27 13:45:09     8

- 윈도우 함수의 다른 응용입니다. 일반 집계함수에서도 윈도우 함수로 활용있는 것이 있고, LAG, LEAD 는 파라메터를 전달하여 사용할 수 있습니다. 
    
  LAG 정렬 기준으로 지정한 수만큼의 이전 수를 가지고오, LEAD에서 지정한 수만큼의 다음 수를 가져 옵니다.

In [30]:
%%SQL
SELECT * FROM (
    SELECT book_id, member_id, rating, rate_date, row_number() OVER (PARTITION BY book_id ORDER BY rate_date) rnum
    FROM rating
) WHERE rnum <= 10
FETCH FIRST 12 ROWS ONLY

    book_id         member_id  rating           rate_date  rnum
1         2          k1jw97m3       9 2022-04-11 15:13:01     1
2         2        1s3sdgncps      10 2023-01-14 12:30:07     2
3         3        3gln64wcw6      10 2019-11-03 11:47:24     1
4         3          r5g55xke      10 2019-11-13 12:08:06     2
5         3       2kijdsgzqzt       9 2020-02-10 13:52:19     3
6         3  kw7w3xr53gtlv2lt       9 2020-08-10 15:32:46     4
7         3     jkyzj42jx8twv       9 2020-08-27 16:35:20     5
8         3        gammptvqxf      10 2020-11-26 10:18:18     6
9         3       6b9eczd6hvd       9 2021-04-22 15:24:36     7
10        3    bas9s86v1bkp89       8 2021-06-27 13:45:09     8
11        3      73y27jopvqmi      10 2021-08-22 13:34:10     9
12        3           nzkqav1      10 2022-01-02 12:37:09    10

In [31]:
%%SQL

SELECT book_id, member_id, rating, 
    MAX(rating) OVER (PARTITION BY book_id) "도서별 최고평점", 
    AVG(rating) OVER (PARTITION BY book_id) "도서별 평균평점",
    LAG(rating, 1) OVER (PARTITION BY book_id ORDER BY rate_date) "이전 도서평점",
    LEAD(rating, 1) OVER (PARTITION BY book_id ORDER BY rate_date) "이후 도서평점"
FROM (
    SELECT * FROM (
        SELECT book_id, member_id, rating, rate_date, row_number() OVER (PARTITION BY book_id ORDER BY rate_date) rnum
        FROM rating
    ) WHERE rnum <= 10
    FETCH FIRST 12 ROWS ONLY 
)

    book_id         member_id  rating  도서별 최고평점 도서별 평균평점 이전 도서평점 이후 도서평점
1         2          k1jw97m3       9        10      9.5    NULL    10.0
2         2        1s3sdgncps      10        10      9.5     9.0    NULL
3         3        3gln64wcw6      10        10      9.4    NULL    10.0
4         3          r5g55xke      10        10      9.4    10.0     9.0
5         3       2kijdsgzqzt       9        10      9.4    10.0     9.0
6         3  kw7w3xr53gtlv2lt       9        10      9.4     9.0     9.0
7         3     jkyzj42jx8twv       9        10      9.4     9.0    10.0
8         3        gammptvqxf      10        10      9.4     9.0     9.0
9         3       6b9eczd6hvd       9        10      9.4    10.0     8.0
10        3    bas9s86v1bkp89       8        10      9.4     9.0    10.0
11        3      73y27jopvqmi      10        10      9.4     8.0    10.0
12        3           nzkqav1      10        10      9.4    10.0    NULL

**WINDOWING 절**

- 지정된 행들의 범위를 현재 행의 위치를 기준으로 한정 (※ SQL Server 미지원)|
- \[BETWEEN 사용\]
> ROWS | RANGE BETWEEN UNBOUNDED PRECEDING | CURRENT ROW | VALUE_EXPR PRECEDING/ FOLLOWING
> 
>       AND UNBOUNDED FOLLOWING | CURRENT ROW | VALUE_EXPR PRECEDING/ FOLLOWING

- \[BETWEEN 미사용\] : 지정한 행부터 현재 행까지
> ROWS | RANGE UNBOUNDED PRECEDING | CURRENT ROW | VALUE_EXPR PRECEDING

**[예제 5]** WINDOWING 기능을 이용하여 각 행에서 정렬 순선를 기준으로 여러개의 행을 대상으로 지정하고 집계 연산을 수행합니다.

- BETWEEN ROWS를 사용하면 범위를 행단위 지정할 수 있 있습니다. 현재행을 기준으로 2 PRECEDING는 2행 선행하부터 CURRENT ROW 현재행 까지를 지정합니다.

In [32]:
%%SQL

SELECT * FROM (
        SELECT book_id, member_id, rating, rate_date, row_number() OVER (PARTITION BY book_id ORDER BY rate_date) rnum
        FROM rating
    ) WHERE rnum <= 10
    FETCH FIRST 10 ROWS ONLY

    book_id         member_id  rating           rate_date  rnum
1         2          k1jw97m3       9 2022-04-11 15:13:01     1
2         2        1s3sdgncps      10 2023-01-14 12:30:07     2
3         3        3gln64wcw6      10 2019-11-03 11:47:24     1
4         3          r5g55xke      10 2019-11-13 12:08:06     2
5         3       2kijdsgzqzt       9 2020-02-10 13:52:19     3
6         3  kw7w3xr53gtlv2lt       9 2020-08-10 15:32:46     4
7         3     jkyzj42jx8twv       9 2020-08-27 16:35:20     5
8         3        gammptvqxf      10 2020-11-26 10:18:18     6
9         3       6b9eczd6hvd       9 2021-04-22 15:24:36     7
10        3    bas9s86v1bkp89       8 2021-06-27 13:45:09     8

In [33]:
%%SQL

SELECT book_id, member_id, rating, rate_date,
    (
        NVL(rating, 0) + 
        NVL(LAG(rating, 1) OVER (PARTITION BY book_id ORDER BY rate_date), 0) +
        NVL(LAG(rating, 2) OVER (PARTITION BY book_id ORDER BY rate_date), 0)
    ) / (
        1 + 
        CASE WHEN LAG(rating, 1) OVER (PARTITION BY book_id ORDER BY rate_date) IS NULL THEN 0 ELSE 1 END +
        CASE WHEN LAG(rating, 2) OVER (PARTITION BY book_id ORDER BY rate_date) IS NULL THEN 0 ELSE 1 END
    ) "3일간 평균평점(직접)",
    AVG(rating) OVER (PARTITION BY book_id ORDER BY rate_date ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) "3일간 평균평점"
FROM (
    SELECT * FROM (
        SELECT book_id, member_id, rating, rate_date, row_number() OVER (PARTITION BY book_id ORDER BY rate_date) rnum
        FROM rating
    ) WHERE rnum <= 10
    FETCH FIRST 10 ROWS ONLY 
)

,book_id,member_id,rating,rate_date,3일간 평균평점(직접),3일간 평균평점
1,2,k1jw97m3,9,2022-04-11 15:13:01,9,9
2,2,1s3sdgncps,10,2023-01-14 12:30:07,9.5,9.5
3,3,3gln64wcw6,10,2019-11-03 11:47:24,10,10
4,3,r5g55xke,10,2019-11-13 12:08:06,10,10
5,3,2kijdsgzqzt,9,2020-02-10 13:52:19,9.66666666666666666666666666666666666667,9.66666666666666666666666666666666666667
6,3,kw7w3xr53gtlv2lt,9,2020-08-10 15:32:46,9.33333333333333333333333333333333333333,9.33333333333333333333333333333333333333
7,3,jkyzj42jx8twv,9,2020-08-27 16:35:20,9,9
8,3,gammptvqxf,10,2020-11-26 10:18:18,9.33333333333333333333333333333333333333,9.33333333333333333333333333333333333333
9,3,6b9eczd6hvd,9,2021-04-22 15:24:36,9.33333333333333333333333333333333333333,9.33333333333333333333333333333333333333
10,3,bas9s86v1bkp89,8,2021-06-27 13:45:09,9,9

- RANGE를 사용하면 ORDER BY의 값을 기준으로 범위를 정할 수 있습니다. 여기서 rnum / 2 이므로 RANGE BETWEEN 1 PRECEDING을 값을 기준으로 1을 앞선 행들을 WINDOW 함수의 대상이 됩니다.

In [34]:
%%SQL

SELECT book_id, member_id, rating, rnum / 2,
    AVG(rating) OVER (PARTITION BY book_id ORDER BY rnum / 2 RANGE BETWEEN 1 PRECEDING AND CURRENT ROW) "평균평점"
FROM (
    SELECT * FROM (
        SELECT book_id, member_id, rating, rate_date, row_number() OVER (PARTITION BY book_id ORDER BY rate_date) rnum
        FROM rating
    ) WHERE rnum <= 10
    FETCH FIRST 10 ROWS ONLY 
)
ORDER BY rate_date

,book_id,member_id,rating,RNUM/2,평균평점
1,3,3gln64wcw6,10,0.5,10
2,3,r5g55xke,10,1,10
3,3,2kijdsgzqzt,9,1.5,9.66666666666666666666666666666666666667
4,3,kw7w3xr53gtlv2lt,9,2,9.33333333333333333333333333333333333333
5,3,jkyzj42jx8twv,9,2.5,9
6,3,gammptvqxf,10,3,9.33333333333333333333333333333333333333
7,3,6b9eczd6hvd,9,3.5,9.33333333333333333333333333333333333333
8,3,bas9s86v1bkp89,8,4,9
9,2,k1jw97m3,9,0.5,9
10,2,1s3sdgncps,10,1,9.5

- 정렬 기준이 일자일 경우 일단위 지정이 가능합니다.

In [35]:
%%SQL

SELECT book_id, member_id, rate_date,
    AVG(rating) OVER (ORDER BY rate_date RANGE BETWEEN INTERVAL '7' DAY PRECEDING AND CURRENT ROW) "7일간 평균평점"
FROM rating
ORDER BY rate_date

,book_id,member_id,rate_date,7일간 평균평점
1,2517,c7pyynbr83h9c,2019-10-03 16:59:05,9
2,211,hzgohln8,2019-10-06 09:27:25,9.5
3,2303,rbth1ra2rrw6bqt2m,2019-10-06 14:30:40,9.33333333333333333333333333333333333333
4,866,im808owbnw261a,2019-10-07 12:10:17,9.25
5,1749,8xia6a2wlek3i,2019-10-07 12:10:51,9.2
...,...,...,...,...
23100,1244,nrs5joxt,2025-02-20 15:20:04,8.79591836734693877551020408163265306122
23101,694,z7w4fse5wx,2025-02-20 15:55:13,8.80808080808080808080808080808080808081
23102,1620,7t2gm7dzcgh8,2025-02-20 16:27:41,8.82828282828282828282828282828282828283
23103,1115,a0hnqp4617ctns,2025-02-20 16:42:44,8.83
23104,2983,q38lh632t55svl,2025-02-20 16:43:30,8.83168316831683168316831683168316831683

- BETWEEN이 아니면 지정 만큼 이전 부터의 데이터에서 현재행까지가 WINDOW 함수의 연산 대상이 됩니다.

In [36]:
%%SQL

SELECT book_id, member_id, rate_date,
    AVG(rating) OVER (ORDER BY rate_date RANGE INTERVAL '7' DAY PRECEDING) "7일간 평균평점"
FROM rating
ORDER BY rate_date

,book_id,member_id,rate_date,7일간 평균평점
1,2517,c7pyynbr83h9c,2019-10-03 16:59:05,9
2,211,hzgohln8,2019-10-06 09:27:25,9.5
3,2303,rbth1ra2rrw6bqt2m,2019-10-06 14:30:40,9.33333333333333333333333333333333333333
4,866,im808owbnw261a,2019-10-07 12:10:17,9.25
5,1749,8xia6a2wlek3i,2019-10-07 12:10:51,9.2
...,...,...,...,...
23100,1244,nrs5joxt,2025-02-20 15:20:04,8.79591836734693877551020408163265306122
23101,694,z7w4fse5wx,2025-02-20 15:55:13,8.80808080808080808080808080808080808081
23102,1620,7t2gm7dzcgh8,2025-02-20 16:27:41,8.82828282828282828282828282828282828283
23103,1115,a0hnqp4617ctns,2025-02-20 16:42:44,8.83
23104,2983,q38lh632t55svl,2025-02-20 16:43:30,8.83168316831683168316831683168316831683

# TOP N 쿼리
|방법|설명|
|----|----|
|ROWNUM<br/>슈도(pseudo) 컬럼|Oracle DBMS에서 사용하는 각각에 행에 부여된 일련 번호<br/>ROWNUM과 WHERE를 이용하여 행의 위치 기반으로 선택<br/>ORDER BY 과정이전에 부여<br/>ORDER BY를 사용하지 않았다면 행의 순서와 ROWNUM은 일치<br/>ORDER BY를 사용한다면 불일치 → INLINE VIEW로 만든 후에 선택|
|TOP (행의 수) \[PERCENT\] \[WITH TIES\]|SQL Server에서 사용<br/>PERCENT: 퍼센트 단위로 선택<br/>WITH TIES: ORDER BY 사용시 사용, 마지막 행과 이후 행과의 정렬 기준값이 같을 경우 포함|
|ROW LIMITING 절|ORACLE 12.1 버전에서 지원<br/>\[OFFSET offset \{ROW \| ROWS\}\]<br/>\[FETCH \{FIRST \| NEXT\} \[\{rowcount \| percent PERCENT\}\] {ROW \| ROWS} \{ONLY \| WITH TIES\}<br/>OFFSET: 건너뛸 행의 수, FETCH: 불러올 행의 수 지정|

**[예제 6]** 불러올 행의 위치와 수를 제어하는 구문에 대해서 알아봅니다.

- Oracle에는 행의 번호를 나타내 주는 ROWNUM이란 기본적으로 내장된 컬럼(pseudo 컬럼)이 있는데요,

  Oracle이 12.1 이전에서는 이 ROWNUM를 이용하여 TOP N과 같은 기능을 구현했습니다.

- ROWNUM 컬럼을 사용해봅니다.

In [37]:
%%SQL

SELECT rownum, book1.* 
FROM book1

,rownum,book_id,book_title,book_categ_id,publisher,pub_date
1,1,2219,사피엔스,1062,김영사,2015-11-01
2,2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,3,1061,양철북 2,489,민음사,2000-03-01
4,4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
7,7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
8,8,1059,데미안,489,민음사,2000-12-01
9,9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
10,10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01

- SQL에서는 열 선택 과정은 정렬(ORDER BY)보다 앞선 단계에서 이루어지기 때문에 ORDER BY를 하면 ROWNUM는 순서에 맞춰진 상태가 아닙니다.

In [38]:
%%SQL

SELECT rownum, book1.*
FROM book1
ORDER BY pub_date

,rownum,book_id,book_title,book_categ_id,publisher,pub_date
1,2,1097,문학이란 무엇인가,509,민음사,1998-09-01
2,3,1061,양철북 2,489,민음사,2000-03-01
3,8,1059,데미안,489,민음사,2000-12-01
4,1,2219,사피엔스,1062,김영사,2015-11-01
5,7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
6,5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
7,9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
8,10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01
9,4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
10,6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01

- 이 상태에서는 정렬에 순서에 따른 행을 선택할 수 없습니다.

In [39]:
%%SQL

SELECT rownum, book1.*
FROM book1
WHERE rownum < 5
ORDER BY pub_date

,rownum,book_id,book_title,book_categ_id,publisher,pub_date
1,2,1097,문학이란 무엇인가,509,민음사,1998-09-01
2,3,1061,양철북 2,489,민음사,2000-03-01
3,1,2219,사피엔스,1062,김영사,2015-11-01
4,4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01

- Oracle에서는 대상 테이블 또는 inline view의 행을 가져오면서, WHERE에서의 선택조건에 해당하는 행들을 추려내는 작업을 수행합니다.

  rownum은 WHERE에서 선택된 행의 개수에 따라 누적됩니다.

In [40]:
%%SQL

SELECT rownum, a.* FROM (
    SELECT book1.*
    FROM book1
    ORDER BY pub_date
) a
WHERE rownum < 5

   rownum  book_id book_title  book_categ_id publisher   pub_date
1       1     1097  문학이란 무엇인가            509       민음사 1998-09-01
2       2     1061      양철북 2            489       민음사 2000-03-01
3       3     1059        데미안            489       민음사 2000-12-01
4       4     2219       사피엔스           1062       김영사 2015-11-01

- Oracle의 rownum 은 1부터 시작하는데 WHERE에서 rownum이 2이상을 가져오도록 하고 있어, rownum은 버려집니다. 계속 rownum은 1이 되기 때문에,

  비어있는 결과를 얻게 되는 것입니다.

In [41]:
%%SQL

SELECT rownum, a.* FROM (
    SELECT book1.*
    FROM book1
    ORDER BY pub_date
) a
WHERE rownum >= 2

Empty DataFrame
Columns: [rownum, book_id, book_title, book_categ_id, publisher, pub_date]
Index: []

- 이런 동작에 의해서,  서브 쿼리 내에서 rownum을 만들어 놓고 상위 쿼리에서 처음 위치의 행을 수를 지정할 수 있습니다.

In [42]:
%%SQL

SELECT * FROM (
    SELECT rownum rnum, a.* FROM (
        SELECT book1.*
        FROM book1
        ORDER BY pub_date
    ) a
    WHERE rownum < 5
)
WHERE rnum >= 2

   rnum  book_id book_title  book_categ_id publisher   pub_date
1     2     1061      양철북 2            489       민음사 2000-03-01
2     3     1059        데미안            489       민음사 2000-12-01
3     4     2219       사피엔스           1062       김영사 2015-11-01

- Oracle 12.1 버젼에서는 불편한 rownum을 사용하지 않아도 행의 위치 기준으로 가져올 수 있는 기능을 제공합니다.

OFFSET \[시작 위치\] ROWS FETCH NEXT \[가져올 데이터 수\] ROWS ONLY

In [43]:
%%SQL

SELECT book1.*
FROM Book1
ORDER BY pub_date
OFFSET 1 ROWS FETCH NEXT 4 ROWS ONLY

   book_id   book_title  book_categ_id publisher   pub_date
1     1061        양철북 2            489       민음사 2000-03-01
2     1059          데미안            489       민음사 2000-12-01
3     2219         사피엔스           1062       김영사 2015-11-01
4     1137  잃어버린 아이 이야기            534       한길사 2017-12-01

# PIVOT 절

행단위의 내용을 열단위(컬럼 레벨)로 정리합니다.

```SQL
PIVOT [XML](
	집계함수 (표현) [[AS] alias] [, 집계함수2(표현2) [[AS] alias2] …
	FOR {컬럼|(컬럼1[, 컬럼2]…)}
	IN ({
		{표현| (표현1, 표현2…)} [[AS] alias]} … 
		| 서브쿼리
		| ANY[, ANY]…
	})
)
```
집계 함수는 행(FOR에 설정되지 않은 항목)과 열(FOR 에서 설정된 항목)에 의해 교차에 의해 생긴 셀에 대응 되는 값들을 처리해 하나의 대표값으로 만들어 주는 함수

FOR 에서는 열단위 배치의 기준이 되는 컬럼

IN 에서는 FOR에서 열단위로 정리한 컬럼값을 지정 합니다.

**서브쿼리와, ANY는 XML구를 넣을 경우 사용 가능**

**[예제 7]** PIVOT의 여러 용법을 알아봅니다.

In [44]:
%%SQL

SELECT * FROM book1

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,1061,양철북 2,489,민음사,2000-03-01
4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
8,1059,데미안,489,민음사,2000-12-01
9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01

- IN의 표현식은 기본적으로 고정 개수이기 때문에 PIVOT에서 다루지 않을 케이스는 기타가 되도록 설정했습니다.

In [45]:
%%SQL

SELECT * 
FROM (
    SELECT EXTRACT(YEAR FROM pub_date) year, 
        CASE 
            WHEN publisher NOT IN ('민음사', '김영사', '마더텅') THEN '기타'
            ELSE publisher 
        END publisher
    FROM book1
)
PIVOT (
    COUNT(*) 빈도 FOR publisher IN ('민음사', '김영사', '마더텅', '기타')
)

   year  '민음사'_빈도  '김영사'_빈도  '마더텅'_빈도  '기타'_빈도
1  2015         0         1         0        0
2  1998         1         0         0        0
3  2000         2         0         0        0
4  2019         0         0         2        1
5  2018         0         0         1        0
6  2021         0         0         0        1
7  2017         0         0         0        1

- PIVOT의 수행은 컬럼의 선택 과정 보다 먼저 이루어집니다. 그리고 복수의 집계작업을 할 수 있습니다.

In [46]:
%%SQL

SELECT book_id, nvl("2024_평가수", 0), round("2024_평균평점", 2), nvl("2025_평가수", 0), round("2025_평균평점", 2) FROM (
    SELECT book_id, EXTRACT(YEAR FROM rate_date) 연도, rating 
    FROM rating
) PIVOT (
    COUNT(*) 평가수, AVG(rating) 평균평점 FOR 연도 IN (2024, 2025)
)

,book_id,"NVL(""2024_평가수"",0)","ROUND(""2024_평균평점"",2)","NVL(""2025_평가수"",0)","ROUND(""2025_평균평점"",2)"
1,23,3,9.33,1,10
2,27,1,8,0,NULL
3,135,0,NULL,0,NULL
4,50,2,8.5,0,NULL
5,52,8,5.63,0,NULL
...,...,...,...,...,...
1786,3452,1,10,0,NULL
1787,3456,0,NULL,0,NULL
1788,3366,0,NULL,1,9
1789,3367,0,NULL,1,10
1790,3377,4,9,0,NULL

- 여러 개의 기준을 사용하여 컬럼을 구성할 수 있습니다.

In [47]:
%%SQL

SELECT * FROM (
    SELECT book_id, EXTRACT(YEAR FROM rate_date) year, 
        CASE 
            WHEN EXTRACT(MONTH FROM rate_date) <= 6 THEN '상반기'
            ELSE '하반기'
        END as 반기구분, rating
    FROM rating
)
PIVOT (
    AVG(Rating) 평균평점 FOR (year, 반기구분) IN ((2023, '상반기'), (2023, '하반기'), (2024, '상반기'), (2024, '하반기'))
)

,book_id,2023_'상반기'_평균평점,2023_'하반기'_평균평점,2024_'상반기'_평균평점,2024_'하반기'_평균평점
1,23,NULL,NULL,9.5,9
2,27,NULL,NULL,NULL,8
3,135,NULL,NULL,NULL,NULL
4,50,9.5,9,8.5,NULL
5,52,5,5.25,5.83333333333333333333333333333333333333,5
...,...,...,...,...,...
1786,3452,NULL,NULL,NULL,10
1787,3456,NULL,NULL,NULL,NULL
1788,3366,NULL,NULL,NULL,NULL
1789,3367,NULL,NULL,NULL,NULL
1790,3377,8.33333333333333333333333333333333333333,8.5,9,9

- ORACLE에서는 컬럼의 구성이 가변적인 쿼리는 성립하지 않습니다. 

따라서 PIVOT에서 IN에 쿼리나 임의의 요소를 대상으로 하려면 XML으로 설정하면, _xml 컬럼 단일컬럼으로 이하 컬럼내용을 하나의 xml로 만들어서 전달합니다.

In [48]:
%%SQL

SELECT * 
FROM (SELECT EXTRACT(YEAR FROM pub_date), publisher FROM book1)
PIVOT XML (
    COUNT(*) 빈도 FOR publisher IN (ANY)
)

,EXTRACT(YEARFROMPUB_DATE),publisher_xml
1,1998,"<PivotSet><item><column name = ""PUBLISHER"">민음사</column><column name = ""빈도"">1</column></item></PivotSet>"
2,2000,"<PivotSet><item><column name = ""PUBLISHER"">민음사</column><column name = ""빈도"">2</column></item></PivotSet>"
3,2015,"<PivotSet><item><column name = ""PUBLISHER"">김영사</column><column name = ""빈도"">1</column></item></PivotSet>"
4,2017,"<PivotSet><item><column name = ""PUBLISHER"">한길사</column><column name = ""빈도"">1</column></item></PivotSet>"
5,2018,"<PivotSet><item><column name = ""PUBLISHER"">마더텅</column><column name = ""빈도"">1</column></item></PivotSet>"
6,2019,"<PivotSet><item><column name = ""PUBLISHER"">마더텅</column><column name = ""빈도"">2</column></item><item><column name = ""PUBLISHER"">저녁달고양이</column><column name = ""빈도"">1</column></item></PivotSet>"
7,2021,"<PivotSet><item><column name = ""PUBLISHER"">까치(까치글방)</column><column name = ""빈도"">1</column></item></PivotSet>"

# UNPIVOT 절

컬럼 단위의 내용을 열단위 내용으로 전환시켜주는 연산입니다.

```SQL
UNPIVOT [{INCLUDE | EXCLUDE} NULLS] (
	{값컬럼| (값컬럼1[, 값컬럼2]…)}
	FOR {컬럼| (컬럼1, [, 컬럼2] …)}
	IN (
	    {전환컬럼|(전환컬럼1[, 전환컬럼2]…)}[AS {리터럴|(리터컬1[, 리터럴2]…)}]
	)
)
```
값컬럼은 컬럼에 담겨 있는 값이 들어갈 컬럼명입니다.

FOR는 컬럼을 나타내는 값이 들어갈 컬럼명입니다.

IN 에서는 행단위로 전환시킬 컬럼을 정의 합니다.

연산에서 지정이 되는 않은 컬럼의 내용은 해당 내용이 UNPIVOT된 내용에 반복됩니다.

In [49]:
%%SQL

SELECT * FROM bookstat

   book_id  stat_ymd  rent_count  rating_sum  rating_count           stat_date
1     2497  20231102           0          25             3 2025-04-02 06:50:15
2     2497  20210915           0          24             3 2025-04-02 06:50:15
3      863  20191013           3           9             1 2025-04-02 06:50:15
4     3345  20201115           3           9             1 2025-04-02 06:50:15
5     1115  20220416           3           8             1 2025-04-02 06:50:15
6     1061  20200613           3           9             1 2025-04-02 06:50:15
7     1059  20240601           1          16             2 2025-04-02 06:50:15
8     2110  20220626           1          17             2 2025-04-02 06:50:15
9     1097  20210227           1          14             2 2025-04-02 06:50:15

**[예제 8]**  UNPIVOT의 기능 파악해봅니다.

In [50]:
%%SQL

SELECT book_id, substr(stat_ymd, 1, 4) as year, rent_count, rating_count 
FROM bookstat -- bookstat의 내용을 봅니다.

   book_id  year  rent_count  rating_count
1     2497  2023           0             3
2     2497  2021           0             3
3      863  2019           3             1
4     3345  2020           3             1
5     1115  2022           3             1
6     1061  2020           3             1
7     1059  2024           1             2
8     2110  2022           1             2
9     1097  2021           1             2

- bookstat의 rent_count와 rating_count를 행단위로 전환시킵니다. 

    컬럼 구분값이 들어가는 컬럼을 '구분', 그리고 컬럼값이 들어가는 컬럼을 '건수' 컬럼으로 지정합니다.

    rent_count는 'RENT'로 rating_count는 'RATING'으로 컬럼 구분값으로 만들어 UNPIVOT을 합니다.

In [51]:
%%SQL

SELECT *
FROM (
    SELECT book_id, substr(stat_ymd, 1, 4) as year, rent_count, rating_count 
    FROM bookstat
)
UNPIVOT (
    건수 FOR 구분 IN (rent_count AS 'RENT', rating_count AS 'RATING')
)

    book_id  year      구분  건수
1      2497  2023    RENT   0
2      2497  2023  RATING   3
3      2497  2021    RENT   0
4      2497  2021  RATING   3
5       863  2019    RENT   3
6       863  2019  RATING   1
7      3345  2020    RENT   3
8      3345  2020  RATING   1
9      1115  2022    RENT   3
10     1115  2022  RATING   1
11     1061  2020    RENT   3
12     1061  2020  RATING   1
13     1059  2024    RENT   1
14     1059  2024  RATING   2
15     2110  2022    RENT   1
16     2110  2022  RATING   2
17     1097  2021    RENT   1
18     1097  2021  RATING   2

- 컬럼그룹을 만들어 UNPIVOT을 수행합니다.

In [52]:
%%SQL

SELECT * FROM (
    SELECT book_id, EXTRACT(YEAR FROM rate_date) year, 
        CASE 
            WHEN EXTRACT(MONTH FROM rate_date) <= 6 THEN '상반기'
            ELSE '하반기'
        END as 반기구분, rating
    FROM rating
)
PIVOT (
    AVG(Rating) 평균평점 FOR (year, 반기구분) IN ((2023, '상반기'), (2023, '하반기'), (2024, '상반기'), (2024, '하반기'))
)

,book_id,2023_'상반기'_평균평점,2023_'하반기'_평균평점,2024_'상반기'_평균평점,2024_'하반기'_평균평점
1,23,NULL,NULL,9.5,9
2,27,NULL,NULL,NULL,8
3,135,NULL,NULL,NULL,NULL
4,50,9.5,9,8.5,NULL
5,52,5,5.25,5.83333333333333333333333333333333333333,5
...,...,...,...,...,...
1786,3452,NULL,NULL,NULL,10
1787,3456,NULL,NULL,NULL,NULL
1788,3366,NULL,NULL,NULL,NULL
1789,3367,NULL,NULL,NULL,NULL
1790,3377,8.33333333333333333333333333333333333333,8.5,9,9

In [53]:
%%SQL

SELECT * FROM (
    SELECT * FROM (
        SELECT book_id, EXTRACT(YEAR FROM rate_date) year, 
            CASE 
                WHEN EXTRACT(MONTH FROM rate_date) <= 6 THEN '상반기'
                ELSE '하반기'
            END as 반기구분, rating
        FROM rating
    )
    PIVOT (
        AVG(Rating) 평균평점 FOR (year, 반기구분) IN ((2023, '상반기'), (2023, '하반기'), (2024, '상반기'), (2024, '하반기'))
    )
)
UNPIVOT (
    (상반기, 하반기) FOR 연도 IN (("2023_'상반기'_평균평점", "2023_'하반기'_평균평점") AS 2023, ("2024_'상반기'_평균평점", "2024_'하반기'_평균평점") AS 2024)
)

      book_id    연도                                       상반기   하반기
1          23  2024                                       9.5     9
2          27  2024                                      NULL     8
3          50  2023                                       9.5     9
4          50  2024                                       8.5  NULL
5          52  2023                                         5  5.25
...       ...   ...                                       ...   ...
1958     3440  2024                                      NULL     9
1959     3447  2024                                      NULL    10
1960     3452  2024                                      NULL    10
1961     3377  2023  8.33333333333333333333333333333333333333   8.5
1962     3377  2024                                         9     9

[1962 rows x 4 columns]

# 정규 표현식

정규 표현식(Regular Expression, RegEx)은
문자열에서 **특정한 규칙(패턴)**을 정의한 식입니다.

정규 표현식을 이용하면 검색·추출·치환을 효과적으로 수행할 수 있습니다.

**문자정의식**

**\[\[^\]{문자|문자1-문자2|문자셋}\[,{문자|문자1-문자2|문자셋}\]\]**

**정규표현식 함수**

|함수|설명|
|---|----|
|REGEXP_LIKE(source_char, pattern\[,match_param\])|정규표현식에 해당 여부|
|REGEXP_REPLACE(source_char, pattern\[, replace_string\[, position\[, occurrence\[,match_param\]\]\]\])|정규표현식에 해당 문자열을 치환하여 반환<br/>replace_string: 치환 패턴, \n n번째 서브패턴|
|REGEXP_SUBSTR(source_char, pattern\[, position\[, occurrence\[, match_param\[, subexpr\]\]\]\])|정규표현식에 해당 패턴을 반환 subexpr(0: 전체, 1이상: 서브패턴 순서)|
|REGEXP_INSTR(source_char, pattern\[, position\[, occurrence\[, match_param\[, subexpr\]\]\]\])|정규표현식에 해당 패턴의 시작 위치 반환|

**source_char**: 대상 컬럼

**pattern**: 정규 표현

**position**: 탐색 시작 위치

**occurrence**: 일치 횟수

**match_param**(기본값 c)

> i – 대소문자 비구분, c –대소문자 구분, n – dot(.)에 개행문자 포함, m-다중행 모드,
>
> x- 검색 패턴에서 공백문자 무시
> 
> 여러 옵션 문자를 조합해서 구성 가능

**[예제 9]** 정규 표현식 함수의 기능을 알아봅니다.

- REGEXP_LIKE 정규 표현식의 패턴에 해당하는 행들을 가져옵니다.

In [54]:
%%SQL

SELECT contents FROM bookdetail WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 5 ROWS ONLY

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              contents
1  EBS 공채 강사, 현직 교사가 전하는\n보석 같은 교육 조언과\n햇살 같은 양육 꿀팁을 모아 담은\n유·초등 부모 맞춤 365 명화 일력\n누구나 생애 처음 부모가 됩니다. 내 부모가 그랬던 것처럼 어느덧 나도 준비 없이 부모가 되었습니다. 아이가 세상에 태어나는 순간, 부모의 삶도 새롭게 시작합니다. 자녀로만 살아오다 부모로 입장이 바뀌면서 세상에 대한 시각도 달라집니다. \n『부모행복일력』은 오늘을 살아가는 젊은 부모들을 위로하고 양육에 도움이 되고자 기획되었습니다. 저자이자 명화 큐레이터인 백다은은 현직 초등학교 교사로서 EBS 공채 강사와 피아노 연주자로 활동하였으며 ‘산타 백쌤’이라는 닉네임으로 아이들의 마음을 읽는 독서교육과 공부법, 학부모, 교사 대상의 다양한 교육 콘텐츠와 수업자료를 개발하고 강의하였습니다. 실제 두 아이를 키우는 부모이기도 한 저자는 양육하면서 마주하는 여러 생각과 감정을 기록해 오다, 아이와 함께 성장하는 자신을 발견하게 되었다고 합니다. ...
2  “초등 문해력이 평생을 좌우합니다!”\n결국 고등학교에서 통하고야 말 초등 가정독서동아리의 모든 것\n\n* 16년 차 국어 교사의 문해력 기초 공사 5단계\n* 네이버 교육 분야 올해의 블로그 〈윤정쌤의 국어가 좋아요〉\n* EBS 수능 영어 강사 정승익, 《거실육아》 임가은 작가 강력 추천\n\n국어와 독서만큼 ‘엄마표 교육’이 효과적인 과목도 없다. 독서토론논술학원은 ‘세계 명작선’, ‘명문대 필독서’처럼 수준 높은 책으로 구성된 커리큘럼이 곧 경쟁력인 만큼 내 아이의 수준과 흥미를 제대로 겨냥할 수 없기 때문이다. 학원에 보내면 어려운 책을 접하고, 끊어 읽기나 짧은 글 쓰기, 원고지 사용법 같은 ‘기술’은 터득할 수 있지만 능동적으로 질문하고 상상하며 읽는 ‘생각의 알맹이’를 채우기는 어렵다. 즉 책을 많이 읽히고 책의 수준을 높인다고 해서 아이의 능력이 향상되는 것이 아니다. 특히나 문해력은 학원이 아닌 가정에서 길러질 때 오롯한 자신의 능력이 된다.\n\n문해력은...
3  중학교부터 영어가 달라진다\n내신부터 수능까지, 한 권으로 끝내는 영어 공부 로드맵 \n초등학교 영어는 중학교 영어와 질적으로 다르다. 중학교 영어는 중급 영어로 향하는 길의 발판이다. 초등학교에서는 단순한 의사소통 표현을 배우고 영어와 친해지는 데 목표를 두지만, 중학교가 되면 문법을 시작하고 공부 양이 급격히 늘어난다. 예를 들어 초등학교에서 배우는 단어는 약 800개이지만 중학교에서 1800개, 고등학교에서 1800개를 배우고 수능을 치르는 데는 적어도 단어 6000개 이상을 알고 있어야 한다. \n영어 유치원 ‘탑반’을 다닌 아이도 ‘엄마표 영어’로 공부한 아이도, 중학교에서 모두 시험이라는 같은 출발점에 선다. 발음이 아무리 좋아도, 간단한 문장을 유창하게 말할 줄 알아도 시험 점수에는 아무런 도움이 되지 않는다. 문법 규칙을 알고 길고 복잡한 글을 잘 읽는 아이가 좋은 점수를 받는다. \n저자는 서울 강남에 있는 중학교에서 영어 교사로 일하던 중, EBS 공개 채용...
4  EBS 〈당신의 문해력〉 〈문해력 유치원〉\n서울대 아동가족학과 최나야 교수가\n아들과 초등 6년 그리고 지금까지도 실천 중인 초등 문해력 독서법\n\n이 책은 EBS 〈당신의 문해력〉으로 대한민국 전체를 문해력에 집중시켰던 최나야 교수가 아들의 문해력을 길러주기 위해 엄마로서 초등학교 6년간 아이와 함께 실천해온 문해력 독서법을 소개하고 있다. 프로그램 방송 이후, 해당 프로그램 연구 책임자였던 최나야 교수 앞으로 많은 문의가 쏟아졌다. 특히 초등학생의 문해력을 키우는 방법에 관한 질문이 많았으며, 최나야 교수가 엄마로서 어떻게 아이의 문해력을 길러주었는지에 대한 관심이 높았다. 따라서 《초등 문해력을 키우는 엄마의 비밀》은 이러한 질문들에 최나야 교수의 실제 경험에서 우러나온 답변을 담은 책이라고 할 수 있다. \n최나야 교수가 말하는 초등 문해력을 성장시키는 비밀은 크게 세 가지로 압축된다. 첫 번째는 엄마가 아이에게 ‘좋은 질문’을 하는 것이고, 두 번째는 ‘책동아리’...
5  대한민국의 많은 부모가 오해하는 사실이 하나 있다. 특목고나 영재학교에 입학할 정도로 성적이 아주 뛰어난 아이들은 ‘타고난 머리’의 영향이 크다는 것. 만약 그 말이 사실이라면 IQ가 낮아도 공부 잘하는 아이들은 어떻게 설명할 수 있을까? EBS육아학교와 60분 부모, YTN사이언스 수다학 등에서 학습 컨설턴트로 활약 중인 대한민국 최고의 교육전문가 민성원 소장은 이렇게 말한다.\n“IQ가 평균 수준만 되어도 그 아이는 충분히 서울대에 갈 수 있습니다!”\n그는 수십 년간 교육 현장에서 만난 사례들을 통해 기존 IQ만으로는 설명할 수 없는 ‘공부 잘하는 머리’의 실체를 연구하기 시작했다. 그 비밀의 첫 번째 열쇠는 단연 ‘지능’이다. 인간의 지능은 폭발적으로 발전하는 때가 있다. 바로 3세부터 13세까지가 적기다. 이 시기에 부모가 아이의 지능을 개발해주는 일은 마치 기초체력을 길러주는 일과 같다. 체력이 좋으면 무슨 운동이든 거뜬히 해내는 것처럼, 어릴 때 지능을 높여주면 ...

- 정규 표현식이 나타낸 부분을 치환합니다. 치환한 할 문자의 기본은 널 문자입니다.

In [55]:
%%SQL

SELECT REGEXP_REPLACE(contents, 'EBS') contents 
FROM bookdetail 
WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 1 ROWS ONLY

contents     공채 강사, 현직 교사가 전하는\n보석 같은 교육 조언과\n햇살 같은 양육 꿀팁을 모아 담은\n유·초등 부모 맞춤 365 명화 일력\n누구나 생애 처음 부모가 됩니다. 내 부모가 그랬던 것처럼 어느덧 나도 준비 없이 부모가 되었습니다. 아이가 세상에 태어나는 순간, 부모의 삶도 새롭게 시작합니다. 자녀로만 살아오다 부모로 입장이 바뀌면서 세상에 대한 시각도 달라집니다. \n『부모행복일력』은 오늘을 살아가는 젊은 부모들을 위로하고 양육에 도움이 되고자 기획되었습니다. 저자이자 명화 큐레이터인 백다은은 현직 초등학교 교사로서  공채 강사와 피아노 연주자로 활동하였으며 ‘산타 백쌤’이라는 닉네임으로 아이들의 마음을 읽는 독서교육과 공부법, 학부모, 교사 대상의 다양한 교육 콘텐츠와 수업자료를 개발하고 강의하였습니다. 실제 두 아이를 키우는 부모이기도 한 저자는 양육하면서 마주하는 여러 생각과 감정을 기록해 오다, 아이와 함께 성장하는 자신을 발견하게 되었다고 합니다. \n \n일...
Name: 1, dtype: object

- 바로 다음에 치환할 문자를 지정할 수 있습니다.

In [56]:
%%SQL

SELECT REGEXP_REPLACE(contents, 'EBS', '이비에스') contents 
FROM bookdetail 
WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 1 ROWS ONLY

contents    이비에스 공채 강사, 현직 교사가 전하는\n보석 같은 교육 조언과\n햇살 같은 양육 꿀팁을 모아 담은\n유·초등 부모 맞춤 365 명화 일력\n누구나 생애 처음 부모가 됩니다. 내 부모가 그랬던 것처럼 어느덧 나도 준비 없이 부모가 되었습니다. 아이가 세상에 태어나는 순간, 부모의 삶도 새롭게 시작합니다. 자녀로만 살아오다 부모로 입장이 바뀌면서 세상에 대한 시각도 달라집니다. \n『부모행복일력』은 오늘을 살아가는 젊은 부모들을 위로하고 양육에 도움이 되고자 기획되었습니다. 저자이자 명화 큐레이터인 백다은은 현직 초등학교 교사로서 이비에스 공채 강사와 피아노 연주자로 활동하였으며 ‘산타 백쌤’이라는 닉네임으로 아이들의 마음을 읽는 독서교육과 공부법, 학부모, 교사 대상의 다양한 교육 콘텐츠와 수업자료를 개발하고 강의하였습니다. 실제 두 아이를 키우는 부모이기도 한 저자는 양육하면서 마주하는 여러 생각과 감정을 기록해 오다, 아이와 함께 성장하는 자신을 발견하게 되었다고 합니다...
Name: 1, dtype: object

- 위치화 치환 횟수를 지정할 수 있습니다

In [57]:
%%SQL

SELECT REGEXP_REPLACE(contents, 'EBS', '이비에스', 1, 1) contents 
FROM bookdetail 
WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 1 ROWS ONLY

contents    이비에스 공채 강사, 현직 교사가 전하는\n보석 같은 교육 조언과\n햇살 같은 양육 꿀팁을 모아 담은\n유·초등 부모 맞춤 365 명화 일력\n누구나 생애 처음 부모가 됩니다. 내 부모가 그랬던 것처럼 어느덧 나도 준비 없이 부모가 되었습니다. 아이가 세상에 태어나는 순간, 부모의 삶도 새롭게 시작합니다. 자녀로만 살아오다 부모로 입장이 바뀌면서 세상에 대한 시각도 달라집니다. \n『부모행복일력』은 오늘을 살아가는 젊은 부모들을 위로하고 양육에 도움이 되고자 기획되었습니다. 저자이자 명화 큐레이터인 백다은은 현직 초등학교 교사로서 EBS 공채 강사와 피아노 연주자로 활동하였으며 ‘산타 백쌤’이라는 닉네임으로 아이들의 마음을 읽는 독서교육과 공부법, 학부모, 교사 대상의 다양한 교육 콘텐츠와 수업자료를 개발하고 강의하였습니다. 실제 두 아이를 키우는 부모이기도 한 저자는 양육하면서 마주하는 여러 생각과 감정을 기록해 오다, 아이와 함께 성장하는 자신을 발견하게 되었다고 합니다....
Name: 1, dtype: object

- 두 번째에서 1회만 치환하게 합니다.

In [58]:
%%SQL

SELECT REGEXP_REPLACE(contents, 'EBS', '이비에스', 2, 1) contents 
FROM bookdetail 
WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 1 ROWS ONLY

contents    EBS 공채 강사, 현직 교사가 전하는\n보석 같은 교육 조언과\n햇살 같은 양육 꿀팁을 모아 담은\n유·초등 부모 맞춤 365 명화 일력\n누구나 생애 처음 부모가 됩니다. 내 부모가 그랬던 것처럼 어느덧 나도 준비 없이 부모가 되었습니다. 아이가 세상에 태어나는 순간, 부모의 삶도 새롭게 시작합니다. 자녀로만 살아오다 부모로 입장이 바뀌면서 세상에 대한 시각도 달라집니다. \n『부모행복일력』은 오늘을 살아가는 젊은 부모들을 위로하고 양육에 도움이 되고자 기획되었습니다. 저자이자 명화 큐레이터인 백다은은 현직 초등학교 교사로서 이비에스 공채 강사와 피아노 연주자로 활동하였으며 ‘산타 백쌤’이라는 닉네임으로 아이들의 마음을 읽는 독서교육과 공부법, 학부모, 교사 대상의 다양한 교육 콘텐츠와 수업자료를 개발하고 강의하였습니다. 실제 두 아이를 키우는 부모이기도 한 저자는 양육하면서 마주하는 여러 생각과 감정을 기록해 오다, 아이와 함께 성장하는 자신을 발견하게 되었다고 합니다....
Name: 1, dtype: object

- REGEXP_SUBSTR은 정규 표현식이 나타내는 문자열만을 가져옵니다.

  정규 표현식에서 .은 특수한 역할을 합니다. .은 개행 문자(\n, newline)이 아닌 모든 문자를 나타냅니다. 그래서 개행 문자를 만나기 전까지의 문자열을 나타냅니다.

In [59]:
%%SQL

SELECT REGEXP_SUBSTR(contents, '.+', 1, 1) contents 
FROM bookdetail 
WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 1 ROWS ONLY

contents    EBS 공채 강사, 현직 교사가 전하는
Name: 1, dtype: object

In [60]:
%%SQL

SELECT REGEXP_SUBSTR(contents, '.+', 1, 2) contents 
FROM bookdetail 
WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 1 ROWS ONLY

contents    보석 같은 교육 조언과
Name: 1, dtype: object

- .이 개행 문자 또한 일반 문자처럼 취급이 될 수 있게 하는 옵션이 'n' 입니다.

In [61]:
%%SQL

SELECT REGEXP_SUBSTR(contents, '.+', 1, 1, 'n') contents 
FROM bookdetail 
WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 1 ROWS ONLY

contents    EBS 공채 강사, 현직 교사가 전하는\n보석 같은 교육 조언과\n햇살 같은 양육 꿀팁을 모아 담은\n유·초등 부모 맞춤 365 명화 일력\n누구나 생애 처음 부모가 됩니다. 내 부모가 그랬던 것처럼 어느덧 나도 준비 없이 부모가 되었습니다. 아이가 세상에 태어나는 순간, 부모의 삶도 새롭게 시작합니다. 자녀로만 살아오다 부모로 입장이 바뀌면서 세상에 대한 시각도 달라집니다. \n『부모행복일력』은 오늘을 살아가는 젊은 부모들을 위로하고 양육에 도움이 되고자 기획되었습니다. 저자이자 명화 큐레이터인 백다은은 현직 초등학교 교사로서 EBS 공채 강사와 피아노 연주자로 활동하였으며 ‘산타 백쌤’이라는 닉네임으로 아이들의 마음을 읽는 독서교육과 공부법, 학부모, 교사 대상의 다양한 교육 콘텐츠와 수업자료를 개발하고 강의하였습니다. 실제 두 아이를 키우는 부모이기도 한 저자는 양육하면서 마주하는 여러 생각과 감정을 기록해 오다, 아이와 함께 성장하는 자신을 발견하게 되었다고 합니다. ...
Name: 1, dtype: object

- .이 개행 문자 또한 일반 문자처럼 취급이 될 수 있게 하는 옵션이 'n' 입니다. 두 번째 문자열은 없습니다.

In [62]:
%%SQL

SELECT REGEXP_SUBSTR(contents, '.+', 1, 2, 'n') contents 
FROM bookdetail 
WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 1 ROWS ONLY

contents    NULL
Name: 1, dtype: object

- REGEXP_INSTR은 패턴의 위치를 반환합니다.
  EBS가 두 번째로 등장한 위치까지 가져옵니다.

In [63]:
%%SQL

SELECT SUBSTR(contents, REGEXP_INSTR(contents, 'EBS', 1, 2)) contents 
FROM bookdetail 
WHERE REGEXP_LIKE(contents, 'EBS') FETCH FIRST 1 ROWS ONLY

contents    EBS 공채 강사와 피아노 연주자로 활동하였으며 ‘산타 백쌤’이라는 닉네임으로 아이들의 마음을 읽는 독서교육과 공부법, 학부모, 교사 대상의 다양한 교육 콘텐츠와 수업자료를 개발하고 강의하였습니다. 실제 두 아이를 키우는 부모이기도 한 저자는 양육하면서 마주하는 여러 생각과 감정을 기록해 오다, 아이와 함께 성장하는 자신을 발견하게 되었다고 합니다. \n \n일력 안에는 사계절의 빛깔을 닮은 아름다운 명화와 함께 부모님들에게 도움이 될 보석 같은 교육 조언들이 가득 담겨 있습니다. 아이들이 단단하게 자라도록 돕는 상황별 부모 언어와 슬기로운 기관 생활을 위한 교육 지침들, 전문적인 교육학 지식과 우리가 아이들과 함께 만들어 갈 건강한 교육 문화에 관한 내용도 담겨 있습니다. 또한 정감있는 일상을 주제로 한 글과 그림들을 통해 가족 간의 유대와 사랑을 느낄 수 있습니다.
Name: 1, dtype: object

In [64]:
%%SQL

SELECT * FROM book1

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,1061,양철북 2,489,민음사,2000-03-01
4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
8,1059,데미안,489,민음사,2000-12-01
9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01

- book_title에서 '패턴: 국어' 이 나오는 행만 가져옵니다.

In [65]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '국어')

,book_id,book_title,book_categ_id,publisher,pub_date
1,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
2,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01

- \[\] 은 안데 패턴에 포한할 문자셋을 지정합니다.

  book_title이 '패턴: (또는 )를 하나 이상 포함' 에 부합하는 행을 가져옵니다.

In [66]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[()]+')

,book_id,book_title,book_categ_id,publisher,pub_date
1,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
2,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01

- \[\] 은 안데 패턴에 포한할 문자셋을 지정합니다.

  book_title이 '패턴: (하나 이상 포함하고, 임의의 문자열이 나오고,  )를 하나 이상 포함' 에 부합하는 행을 가져옵니다.

In [67]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[(]{1}.+[)]{1}')

,book_id,book_title,book_categ_id,publisher,pub_date
1,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
2,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01

- [] 은 안데 패턴에 포한할 문자셋을 지정합니다.

  book_title이 '패턴: )하나 이상 포함하고, 임의의 문자열이 나오고,  (를 하나 이상 포함' 에 부합하는 행을 가져옵니다.

In [68]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[)]{1}.+[(]{1}')

Empty DataFrame
Columns: [book_id, book_title, book_categ_id, publisher, pub_date]
Index: []

In [69]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[()]{1}.+[()]{1}')

,book_id,book_title,book_categ_id,publisher,pub_date
1,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
2,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01

- [] 은 안데 패턴에 포한할 문자셋을 지정합니다.

  publisher가 '텅 또는 사 를 포함' 에 부합하는 행을 가져옵니다.

In [70]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(publisher, '[텅사]')

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,1061,양철북 2,489,민음사,2000-03-01
4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
7,1059,데미안,489,민음사,2000-12-01
8,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01

- [] 은 안데 패턴에 포한할 문자셋을 지정합니다.

  book_title이 '패턴: 0에서 9에 해당하는 문자에 하나 이상 포함' 에 부합하는 행을 가져옵니다.

In [71]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[0-9]+')

,book_id,book_title,book_categ_id,publisher,pub_date
1,1061,양철북 2,489,민음사,2000-03-01
2,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
3,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
4,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01

|문자셋|설명|
|---|----|
|[:digit:]|숫자, [0-9]|
|[:lower:]|소문자, [a-z]|
|[:upper:]|대문자, [A-Z]|
|[:alpha:]|영문자, [a-zA-Z]|
|[:alnum:]|영문자와 숫자, [0-9a-zA-Z]|
|[:xdigit:]|16진숫자, [0-9a-fA-F]|
|[:punct:]|문장부호, [^[:alnum:][:cntrl:]]|
|[:space:]|공간문자(space, enter, tab)|
|[:blank:]|NULL 문자|

**.(dot) 연산자**: newline을 제외한 모든 문자

**PERL 문자 정의 연산자**
    
|연산자|설명|
|----|----|
|\d|숫자, [0-9], [[:digit:]]|
|\D|숫자가 아닌 모든 문자 [^0-9], [^[:digit:]]|
|\w|숫자와 영문자(under bar 포함] [0-9a-zA-Z_], [[:alnum:]_]|
|\W|숫자와 영문자, under bar가 아닌 모든 문자 <br/>[^0-9a-zA-Z_] , [^[:alnum:]_]|
|\s|공간문자[ \t\r], [[:space:]]|
|\S|비공간문자[^ \t\r], [^[:space:]]|

**[예제10]** 사전에 정의된 문자셋과 PERL 문자 정의자를 써봅니다.

- '패턴: \[:digit:\]에 하나이상 포함'

  \[:digit:\] = \[0-9\]

In [72]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[[:digit:]]+')

,book_id,book_title,book_categ_id,publisher,pub_date
1,1061,양철북 2,489,민음사,2000-03-01
2,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
3,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
4,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01

- PERL 패턴 \d = [0-9] 에 대응

In [73]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '\d+')

,book_id,book_title,book_categ_id,publisher,pub_date
1,1061,양철북 2,489,민음사,2000-03-01
2,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
3,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
4,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01

- '패턴: \[:lower:\]에 하나이상 포함'

  \[:lower:\] = \[a-z\]

In [74]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[[:lower:]]+')

Empty DataFrame
Columns: [book_id, book_title, book_categ_id, publisher, pub_date]
Index: []

- '패턴: \[:upper:\]에 하나이상 포함'

  \[:upper:\] = \[A-Z\]

In [75]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[[:upper:]]+')

Empty DataFrame
Columns: [book_id, book_title, book_categ_id, publisher, pub_date]
Index: []

- '패턴: \[:alpha:\]에 하나이상 포함'

  \[:alpha:\] = \[a-zA-Z\]

In [76]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[[:alpha:]]+')

,book_id,book_title,book_categ_id,publisher,pub_date
1,2219,사피엔스,1062,김영사,2015-11-01
2,1097,문학이란 무엇인가,509,민음사,1998-09-01
3,1061,양철북 2,489,민음사,2000-03-01
4,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
5,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
6,2497,생명이란 무엇인가,1196,까치(까치글방),2021-01-01
7,1137,잃어버린 아이 이야기,534,한길사,2017-12-01
8,1059,데미안,489,민음사,2000-12-01
9,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01
10,1092,동주와 빈센트,503,저녁달고양이,2019-09-01

- '패턴: \[:punct:\]에 하나이상 포함'

  \[:punct:\] = 문장부호

In [77]:
%%SQL

SELECT * FROM book1 WHERE REGEXP_LIKE(book_title, '[[:punct:]]+')

,book_id,book_title,book_categ_id,publisher,pub_date
1,3270,"뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)",1550,마더텅,2019-12-01
2,3233,"뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)",1535,마더텅,2018-03-01
3,3345,초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1,1568,마더텅,2019-04-01

- 문장 부호를 공백으로 치환

In [78]:
%%SQL

SELECT REGEXP_REPLACE(book_title, '[[:punct:]]+'), book_title FROM book1 WHERE REGEXP_LIKE(book_title, '[[:punct:]]+')

  REGEXP_REPLACE(BOOK_TITLE,'[[:PUNCT:]]+')                       book_title
1              뿌리깊은 초등국어 독해력 어휘편 3단계 초등34학년  뿌리깊은 초등국어 독해력 어휘편 3단계 (초등3,4학년)
2                  뿌리깊은 초등국어 독해력 1단계 초등12학년      뿌리깊은 초등국어 독해력 1단계 (초등1,2학년)
3             초등영어 받아쓰기듣기 10회 모의고사 초등 6학년 1   초등영어 받아쓰기·듣기 10회 모의고사 초등 6학년 1

**특수문자**

|연산자|설명|
|----|----|
|\t|tab|
|\n|newline|
|\r|return|
|\b|backspace|

**앵커**

|연산자|설명|
|----|-----|
|^|문자열의 시작|
|$|문자열의 끝|


**수량사(Qualifier)**

<table>
  <tr>
    <th colspan="2">수량연산자</th><th>설명</th>
  </tr>
  <tr>
    <th>탐욕적 방식</th><th>비탐욕적 방식</th><th>설명</th>
  </tr>
  <tr>
    <td>?</td><td>?</td><td>0회 또는 1회 일치</td>
  </tr>
  <tr>
    <td>*</td><td>*?</td><td>0회 또는 그 이상 일치</td>
  </tr>
  <tr>
    <td>+</td><td>+?</td><td>1회 또는 그 이상 일치</td>
  </tr>
  <tr>
    <td>{m}</td><td>{m}?</td><td>m회 일치</td>
  </tr>
  <tr>
    <td>{m,}</td><td>{m,}?</td><td>최소 m회 이상 일치</td>
  </tr>
  <tr>
    <td>{,m }</td><td>{,m}?</td><td>최대 m회 일치</td>
  </tr>
  <tr>
    <td>{m,n}</td><td>{m,n}?</td><td>최소 m회 최대 n회 일치</td>
  </tr>
</table>


**특수 연산자**

|연산자|설명|
|-----|-----|
|\||OR 연산, 정규표현식1|정규표현식2|
|\\|이스케이프 문자: 연산자를 일반 문자로 취급|

**[예제 11]** 앵커기능을 확인합니다.

In [79]:
%%SQL
SELECT REGEXP_SUBSTR('CABBBB', '^AB+?'), REGEXP_SUBSTR('CABBBB', 'AB+') FROM DUAL

REGEXP_SUBSTR('CABBBB','^AB+?')     NULL
REGEXP_SUBSTR('CABBBB','AB+')      ABBBB
Name: 1, dtype: object

In [80]:
%%SQL
SELECT REGEXP_SUBSTR('ABBBBC', 'AB+?$'), REGEXP_SUBSTR('ABBBBC', 'AB+') FROM DUAL

REGEXP_SUBSTR('ABBBBC','AB+?$')     NULL
REGEXP_SUBSTR('ABBBBC','AB+')      ABBBB
Name: 1, dtype: object

**[예제 12]** 수량 한정사아 비탐욕적은 정규 표현식에 해당하는 문자열의 길이를 작게, 탐욕적은 되도록이면 길게 일치시키는 방법에 대해 알아봅니다.

In [81]:
%%SQL
SELECT REGEXP_SUBSTR('ABBBBC', 'AB{1}'), REGEXP_SUBSTR('ABBBBC', 'AB{2}') FROM DUAL

REGEXP_SUBSTR('ABBBBC','AB{1}')     AB
REGEXP_SUBSTR('ABBBBC','AB{2}')    ABB
Name: 1, dtype: object

In [82]:
%%SQL
SELECT REGEXP_SUBSTR('ABBBBC', '(AB){1}'), REGEXP_SUBSTR('ABBBBC', '(AB){2}') FROM DUAL

REGEXP_SUBSTR('ABBBBC','(AB){1}')      AB
REGEXP_SUBSTR('ABBBBC','(AB){2}')    NULL
Name: 1, dtype: object

In [83]:
%%SQL

SELECT REGEXP_SUBSTR('ABBBB', 'AB+?'), REGEXP_SUBSTR('ABBBB', 'AB+') FROM DUAL

REGEXP_SUBSTR('ABBBB','AB+?')       AB
REGEXP_SUBSTR('ABBBB','AB+')     ABBBB
Name: 1, dtype: object

In [84]:
%%SQL

SELECT REGEXP_SUBSTR('ABBBBC', 'AB+?C'), REGEXP_SUBSTR('ABBBBC', 'AB+C') FROM DUAL

REGEXP_SUBSTR('ABBBBC','AB+?C')    ABBBBC
REGEXP_SUBSTR('ABBBBC','AB+C')     ABBBBC
Name: 1, dtype: object

**[예제 13]** \는 정규 표현식에서 특수 문자를 일반 문자로 나타낼 수 있게 합니다.

In [85]:
%%SQL

SELECT REGEXP_SUBSTR('\\', '\+?') FROM DUAL

REGEXP_SUBSTR('\\','\+?')    NULL
Name: 1, dtype: object

In [86]:
%%SQL

SELECT REGEXP_SUBSTR('\\', '\\+?') FROM DUAL

REGEXP_SUBSTR('\\','\\+?')    \
Name: 1, dtype: object